# RegisterFaceWithElementHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..RegisterFaceWithElementHandle Method
ExporterIFC Class See Also
---
Register face with element handle to make sure the openings created are related to the right element.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RegisterFaceWithElementHandle(
	Face face,
	IFCAnyHandle elemHandle
)
```

Visual Basic
---
```text
Public Sub RegisterFaceWithElementHandle ( _
	face As Face, _
	elemHandle As IFCAnyHandle _
)
```

Visual C++
---
```text
public:
void RegisterFaceWithElementHandle(
	Face^ face,
	IFCAnyHandle^ elemHandle
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..Face The face.
elemHandle
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The element handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace